Repository: evgenyuliganets/Findy-Hotel
Catalog: lib/l10n/app_*.arb
Languages: es, ru

source: Hello World!
es: ¡Hola Mundo!
ru: Привет Мир!

# welcomeAppLogin
source: Welcome to Findy Hotel!
es: ¡Bienvenidos a Findy Hotel!
ru: Приветствуем в Findy Hotel!

# firstSlide
source: Find hotels through search
es: Encuentra hoteles a través de la búsqueda
ru: Ищите отели через поиск

# secondSlide
source: Get complete information about the selected hotel
es: Obtenga información completa sobre el hotel seleccionado
ru: Получите полную информацию о выбранном отеле

# thirdSlide
source: Add selected hotels to your favorites list to view them offline!
es: ¡Agregue hoteles a su lista de favoritos para verlos sin conexión!
ru: Добавляйте отели в список избранных, и смотрите их в офлайн!

# fourthSlide
source: Browse hotels near you on the map
es: Buscar hoteles cercanos en el mapa
ru: Просматривайте отели, которые находятся рядом с вами на карте

# headerInput
source: Write your Name and lets get started!
es: ¡Escriba su nombre y comencemos!
ru: Напишите свое имя и приступим!

# inputHint
source: Name
es: Nombre
ru: Имя

# loginButton
source: Login
es: Acceder
ru: Войти

# errorInput
source: Invalid name
es: Nombre inválido
ru: Неверное имя

# homeTab
source: Home
es: Inicio
ru: Главная

# homeMainError
source: Sorry, places was not found!
es: ¡Lo sentimos, no se encontraron ubicaciones!
ru: Простите, места не были найдены!

# homeByPlace
source: By Place
es: Detrás del lugar
ru: За местом

# homeByName
source: By Name
es: Detrás del nombre
ru: За названием

# homeSearch
source: Search
es: Búsqueda
ru: Поиск

# searchFilterKeyword1
source: Restaurant
es: Restaurante
ru: Ресторан

# searchFilterKeyword2
source: Bar
ru: Бар

# searchFilterKeyword3
source: Spa
ru: Спа

# searchFilterKeyword4
source: Campground
es: Camping
ru: Кемпинг

# searchFilterPriceLevel1
source: Free
es: Gratis
ru: Бесплатно

# searchFilterPriceLevel2
source: Inexpensive
es: Barato
ru: Не дорого

# searchFilterPriceLevel3
source: Moderate
es: Precio medio
ru: Средняя цена

# searchFilterPriceLevel4
source: Expensive
es: Caro
ru: Дорого

# searchFilterPriceLevel5
source: Very Expensive
es: Muy caro
ru: Очень дорого

# searchFilterHeader
source: Select Filters
es: Seleccionar filtros
ru: Выберите фильтры

# searchFilterError
source: Cannot change value when distance type is selected
es: No se puede cambiar el radio cuando se selecciona ordenar por distancia
ru: Нельзя изменить радиус когда выбран порядок за дистанцией

# searchFilterRadius
source: Radius:
es: Radio:
ru: Радиус:

# searchFilterMeters
source: meters
es: metros
ru: метров

# searchFilterKeywordHeader
source: Additional type of search
es: Tipo de búsqueda adicional
ru: Дополнительный тип поиска

# searchFilterMinPriceHeader
source: Minimum Price
es: Precio mínimo
ru: Минимальная цена

# searchFilterMaxPriceHeader
source: Maximum Price
es: Precio máximo
ru: Максимальная цена

# searchOrderHeader
source: Search order
es: Orden de búsqueda
ru: Порядок поиска

# searchOrder1
source: Prominence(default)
es: Importancia (predeterminado)
ru: Важность (по умолчанию)

# searchOrder2
source: Distance
es: Distancia
ru: Дистанция

# searchFilterApplyButton
source: Apply
es: Aplicar
ru: Применить

# detailedHeader
source: Detailed info
ru: Подробная информация

# detailedError
source: Sorry, place was not found!
ru: Простите, это место не было найдено!

# detailedRatingError
source: No Rating
ru: Без рейтинга

# detailedOpenText
source: Open Now:
ru: Открыто сейчас:

# detailedOpenStatus1
source: Open
ru: Открыто

# detailedClosesInText
source: | Closes In:
ru: | Закрывается в:

# detailedClosesInStatus1
source: Open 24 hours
ru: Открыто 24 часа

# detailedOpenStatus2
source: Closed
ru: Закрыто

# detailedOpensInText
source: | Opens In:
ru: | Открывается в:

# detailedPriceLevelText
source: Price Level:
ru: Уровень цены:

# detailedAddressText
source: Full Address:
ru: Адрес:

# detailedPhoneText
source: Phone Number:
ru: Телефонный номер:

# detailedCopiedToClipboard
source: Copied to Clipboard
ru: Скопировано в буфер обмена

# detailedWebsiteText
source: Website:
ru: Веб-сайт:

# detailedHoursUtsText
source: hours From UTC
ru: часов от UTC

# detailedOnMap
source: On Map
ru: На Карте

# homeResultsOnMap
source: Show results on Map
es: Mostrar resultados en un mapa
ru: Показать результаты на Карте

# mapResultsOnList
source: Show results as list
es: Mostrar resultados como una lista
ru: Показать результаты как список

# placeNetworkError
source: Place not found, try again later
es: Lugar no encontrado, inténtalo más tarde
ru: Место не найдено, попробуйте позже

source: Unknown Error
es: Error desconocido
ru: Неизвестная ошибка

# timeoutRepoError
source: Timeout was reached, try reload later or check connection
es: El tiempo de espera expiró, intente reiniciar más tarde o verifique la conexión
ru: Время ожидания вышло, попробуйте перезагрузить позже или проверьте соединение

# noResultsErr
source: No results found, try change filters
es: No se encontraron resultados, intente cambiar los filtros
ru: Результаты не найдены, попробуйте изменить фильтры

# locPermissionErr
source: Location permission is not granted, please grant permission to see places near you
es: No se ha obtenido permiso para obtener la ubicación, concede permiso para ver lugares cercanos
ru: Разрешение на получение локации не было получено, предоставьте разрешение для просмотра мест вблизи вас

# placesDatabaseErr
source: Places in Database was not found
es: No se encontraron lugares guardados en la base de datos
ru: Не было найдено ни одного сохраненного места в базе данных

# placeDatabaseErr
source: This place was not found in database
es: Este lugar no se encontró en la base de datos
ru: Это место не найдено в базе данных

# lastLocationNotify
source: Places was loaded from last known location
es: Ubicaciones cargadas después de la última ubicación conocida
ru: Места загружены за последней известной локацией

# placesTimeoutExt
source: Timeout was reached. No Internet Connection or GPS is not enabled
es: El tiempo de espera expiró. No hay conexión a Internet o el GPS no está habilitado
ru: Время ожидания вышло. Нет подключения к Интернету или GPS не включен

# placesFromDatabase
source: All Places was loaded from database
es: Todos los lugares se cargan desde la base de datos
ru: Все места загружены из базы данных

# placesFromDatabaseErr
source: No places found in database
es: No se encontraron lugares guardados en la base de datos
ru: Не было найдено ни одного сохраненного места в базе данных

# placesFromDatabaseCriticalErr
source: Something went wrong in database, try logout
es: Algo salió mal en la base de datos, intente cerrar la sesión
ru: Что-то пошло не так в базе данных, попробуйте выйти из акаунта

source: No Internet Connection
es: Sin conexión a Internet
ru: Нет подключения к Интернету

# unknownErrorExt
source: Something went wrong, try change filters
es: Algo salió mal, intente cambiar los filtros
ru: Что-то пошло не так, попробуйте изменить фильтры

# placesTimeoutNetwork
source: Timeout was reached. No Internet Connection
es: Se agotó el tiempo de espera. No hay conexión a Internet
ru: Время ожидания вышло. Нет подключения к Интернету

# placeFromDatabase
source: Place was loaded from database
es: Lugar cargado desde la base de datos
ru: Место загружено из базы данных

# favoriteError
source: Favorite places was not found in database
es: Los lugares favoritos no se encontraron en la base de datos
ru: Любимые места не найдены в базе данных

# recentError
source: Recently Viewed places was not found in database
ru: Раньше пересмотреные места не найдены в базе данных

# recentHeader
source: Recently Viewed Places
ru: Раньше пересмотреные места

# favoriteHeader
source: Favorite Places
es: Lugares favoritos
ru: Любимые места

# favErrorHeader
source: Sorry, your favorite places not found, try add some
es: Lo sentimos, no se encontraron favoritos, intente agregar algunos
ru: Простите, любимые места не найдены, попробуйте добавить некоторые

# lastLocationExtNotify
source: Places was loaded from last known location, try change filters
es: Ubicaciones cargadas desde la última ubicación conocida, intente cambiar los filtros
ru: Места загружены с последней известной локации, попробуйте изменить фильтры

# favDatabaseError
source: Something went wrong while adding place in favorite
es: Se produjo un error al agregar un lugar a favoritos, intente cerrar la sesión
ru: Что-то пошло не так при добавлении места в любимые, попробуйте выйти из аккаунта

# errorFavorite
source: Cannot save to favorite
es: No se pudo guardar en la lista de favoritos
ru: Не удалось сохранить в список любимых

# successFavorite
source: Successfully saved to favorite
es: Se guardó correctamente en la lista de favoritos
ru: Успешно сохранено в список любимых

# deletedFavorite
source: Successfully deleted from favorite
es: Eliminado correctamente de la lista de favoritos
ru: Успешно удален из списка любимых

# deletingFavoriteErr
source: Something went wrong while deleting place from favorite
es: Se produjo un error al eliminar un lugar de tus favoritos, intenta cerrar la sesión
ru: Что-то пошло не так при удалении места из списка любимых, попробуйте выйти из аккаунта

# mapTab
source: Map
es: Mapa
ru: Карта

# profileTab
source: Profile
es: Perfil
ru: Профиль

# headerProfile
source: Hello,
es: ¡Hola,
ru: Привет,

source: Logout
es: Salir
ru: Выйти

# cancelButton
source: Cancel
es: Cancelar
ru: Отменить

# warningProfile
source: You sure you want to logout? All local data will be erased!
es: ¿Seguro que quieres salir? ¡Todos los datos locales serán eliminados!
ru: Вы уверенны что хотите выйти? Все локальные данные будут удалены!

# recentHeaderError
source: Sorry, your recently viewed places not found, try view some
es: Lo sentimos, no se han encontrado los lugares que viste recientemente. Prueba a ver algunos..
ru: Извините, ваши ближайшие места не были найдены.
